def get_text(money):
    names = {1: 'одна',
             2: 'дві',
             3: 'три',
             4: 'чотири',
             5: 'п\'ять',
             6: 'шість',
             7: 'сім',
             8: 'вісім',
             9: 'дев\'ять',
             10: 'десять',
             11: 'одинадцять',
             12: 'дванадцять',
             13: 'тринадцять',
             14: 'чотирнадцять',
             15: 'п\'ятнадцять',
             16: 'шістнадцять',
             17: 'сімнадцять',
             18: 'вісімнадцять',
             19: 'дев\'ятнадцять',
             }

    if money // 1000 > 0:
        print(names[money // 1000], 'тисяча')
        money %= 1000
    if money // 100 > 0:
        print(names[money // 100], 'сто')
        money %= 100
    if money // 10 > 0:
        print(names[money // 10], 'десять')
        money %= 10
    if money // 1 > 0:
        print(names[money // 1])
    money = round(money, 2)
    if str(money)[-2:]:
        print(str(money)[-2:], 'коп.')
